from augban.sentence import TokenReplacement

def test_mask_based():
    tokr = TokenReplacement()
    text = "আমার নাম জাহিদ, আমি ঢাকায় বাস করি।"
    output = tokr.masking_based(text)
    print(output)

if __name__ == "__main__":
    test_mask_based()

# ['আমার বন্ধু জাহিদ, আমি ঢাকায বাস করি ।', 'আমার বাবা জাহিদ, আমি ঢাকায বাস করি ।', 'আমার স্বামী জাহিদ, আমি ঢাকায বাস করি ।', 
# 'আমার মা জাহিদ, আমি ঢাকায বাস করি ।', 'আমার নাম জাহিদ, আমি ঢাকায বাস করি ।', 'আমার নাম জাহিদ, আমি ঢাকায বাস করি ।', 
# 'আমার নাম জাহিদ, আমি ঢাকায বাস করছি ।', 'আমার নাম জাহিদ, আমি ঢাকায বাস করতাম ।', 'আমার নাম জাহিদ, আমি ঢাকায বাস করেছি ।', 
# 'আমার নাম জাহিদ, আমি ঢাকায বাস করিনি ।', 'আমার বন্ধু জাহিদ, আমি ঢাকায বাস করি ।', 'আমার বাবা জাহিদ, আমি ঢাকায বাস করি ।', 
# 'আমার স্বামী জাহিদ, আমি ঢাকায বাস করি ।', 'আমার মা জাহিদ, আমি ঢাকায বাস করি ।', 'আমার নাম জাহিদ, আমি ঢাকায বাস করি ।', 
# 'আমার নাম জাহিদ, আমি ঢাকায বাস করি ।', 'আমার নাম জাহিদ, আমি ঢাকায ব্যবহার করি ।', 'আমার নাম জাহিদ, আমি ঢাকায চাকরি করি ।', 
# 'আমার নাম জাহিদ, আমি ঢাকায গ্রহণ করি ।', 'আমার নাম জাহিদ, আমি ঢাকাযণ করি ।', 'আমার নাম জাহিদ, আমি ঢাকায বাস করি ।', 
# 'আমার নাম জাহিদ, আমি ঢাকায ব্যবহার করি ।', 'আমার নাম জাহিদ, আমি ঢাকায চাকরি করি ।', 'আমার নাম জাহিদ, আমি ঢাকায গ্রহণ করি ।', 
# 'আমার নাম জাহিদ, আমি ঢাকাযণ করি ।']