from augban.sentence import TokenReplacement, TextGeneration

def test_mask_based():
    tokr = TokenReplacement()
    text = "আমি ঢাকায় বাস করি।"
    output = tokr.masking_based(text, mask_model='csebuetnlp/banglabert_generator')
    print(output)

def test_word2vec_based():
    tokr = TokenReplacement()
    text = "আমি ঢাকায় বাস করি।"
    model = "msc/bangla_word2vec/bnwiki_word2vec.model"
    output = tokr.word2vec_based(text, model=model)
    print(output)

def test_glove_based():
    tokr = TokenReplacement()
    text = "আমি ঢাকায় বাস করি।"
    model = "msc/bn_glove.300d.txt"
    output = tokr.glove_based(text, vector_path=model)
    print(output)

def test_parapharse():
    gen = TextGeneration()
    text = "আমি ঢাকায় বাস করি।"
    out = gen.paraphrase(text)
    print(out)

if __name__ == "__main__":
    # test_mask_based()
    # test_parapharse()
    # test_word2vec_based()
    test_glove_based()

# ['আমি এখানে বাস করি ।', 'আমি সেখানে বাস করি ।', 'আমি বাস করি ।', 'আমি বাংলাদেশে বাস করি ।', 
# 'আমি ওখানে বাস করি ।', 'আমি ঢাকায বাস করি ।', 'আমি ঢাকায ভ্রমণ করি ।', 'আমি ঢাকায কাজ করি ।', 
# 'আমি ঢাকায ব্যবহার করি ।', 'আমি ঢাকায পালন করি ।', 'আমরা ঢাকায বাস করি ।', 'আমি ঢাকায বাস করি ।', 
# 'এখানে ঢাকায বাস করি ।', 'সেখানে ঢাকায বাস করি ।', 'বাসে ঢাকায বাস করি ।', 'আমি ঢাকায বাস করি ।', 
# 'আমি ঢাকায বাস করছি ।', 'আমি ঢাকায বাস করেছি ।', 'আমি ঢাকায বাস করতাম ।', 'আমি ঢাকায বাস করিনি ।', 
# 'আমরা ঢাকায বাস করি ।', 'আমি ঢাকায বাস করি ।', 'এখানে ঢাকায বাস করি ।', 'সেখানে ঢাকায বাস করি ।', 
# 'বাসে ঢাকায বাস করি ।']

# ['আমি ঢাকায় বাস করিএবং', 'আমি ঢাকায় বাস করি.', 'আমি ঢাকায় বাস করিযাতে', 'আমি ঢাকায় বাস করিযা', 
# 'আমি ঢাকায় বাস করিযেখানে', 'আমি ঢাকায় বসবাস করি।', 'আমি ঢাকায় যাতায়াত করি।', 'আমি ঢাকায় চলাচল করি।', 
# 'আমি ঢাকায় ঘোরাফেরা করি।', 'আমি ঢাকায় ভ্রমণ করি।', 'আমি ঢাকায় বাস করছি।', 'আমি ঢাকায় বাস করব।', 
# 'আমি ঢাকায় বাস করেছি।', 'আমি ঢাকায় বাস করুন।', 'আমি ঢাকায় বাস করো।', 'আমি ঢাকায় বসবাস করি।', 
# 'আমি ঢাকায় যাতায়াত করি।', 'আমি ঢাকায় চলাচল করি।', 'আমি ঢাকায় ঘোরাফেরা করি।', 'আমি ঢাকায় ভ্রমণ করি।', 
# 'আমি ঢাকায় বসবাস করি।', 'আমি ঢাকায় যাতায়াত করি।', 'আমি ঢাকায় চলাচল করি।', 'আমি ঢাকায় ঘোরাফেরা করি।', 
# 'আমি ঢাকায় ভ্রমণ করি।']

# ['আমি ঢাকায় বাস করি।', 'আমার ঢাকায় বাস করি।', 'করি ঢাকায় বাস করি।', 'আমাকে ঢাকায় বাস করি।', 'আমরা ঢাকায় বাস করি।', 
# 'আমি ঢাকায় বাস করি।', 'আমি ঢাকায় বসবাস করি।', 'আমি ঢাকায় মিনিবাস করি।', 'আমি ঢাকায় ভলভো করি।', 
# 'আমি ঢাকায় লোকের করি।', 'আমি ঢাকায় বাস করি।', 'আমি ঢাকায় বসবাস করি।', 'আমি ঢাকায় মিনিবাস করি।', 
# 'আমি ঢাকায় ভলভো করি।', 'আমি ঢাকায় লোকের করি।']